<template>
  <ui-container>
    <ui-table
      :headers="[
        { text: 'Кол-во токенов', value: 'amount' },
        { text: 'Сумма', value: 'summ' },
        { text: 'Дата', value: 'date' },
        { text: 'Назначение', value: 'title' },
      ]"
      :items="[
        {
          amount: 'Кол-во токенов',
          summ: '1',
          date: '20.08.2022',
          title: 'Назначение',
        },
        {
          amount: 'Кол-во токенов',
          summ: '2',
          date: '20.08.2022',
          title: 'Назначение',
        },
        {
          amount: 'Кол-во токенов',
          summ: '3',
          date: '20.08.2022',
          title: 'Назначение',
        },
        {
          amount: 'Кол-во токенов',
          summ: '4',
          date: '20.08.2022',
          title: 'Назначение',
        },
        {
          amount: 'Кол-во токенов',
          summ: '5',
          date: '20.08.2022',
          title: 'Назначение',
        },
        {
          amount: 'Кол-во токенов',
          summ: '10',
          date: '20.08.2022',
          title: 'Назначение',
        },
        {
          amount: 'Кол-во токенов',
          summ: '10',
          date: '20.08.2022',
          title: 'Назначение',
        },
        {
          amount: 'Кол-во токенов',
          summ: '10',
          date: '20.08.2022',
          title: 'Назначение',
        },
        {
          amount: 'Кол-во токенов',
          summ: '10',
          date: '20.08.2022',
          title: 'Назначение',
        },
        {
          amount: 'Кол-во токенов',
          summ: '10',
          date: '20.08.2022',
          title: 'Назначение',
        },
        {
          amount: 'Кол-во токенов',
          summ: '10',
          date: '20.08.2022',
          title: 'Назначение',
        },
        {
          amount: 'Кол-во токенов',
          summ: '10',
          date: '20.08.2022',
          title: 'Назначение',
        },
        {
          amount: 'Кол-во токенов',
          summ: '10',
          date: '20.08.2022',
          title: 'Назначение',
        },
        {
          amount: 'Кол-во токенов',
          summ: '10',
          date: '20.08.2022',
          title: 'Назначение',
        },
        {
          amount: 'Кол-во токенов',
          summ: '10',
          date: '20.08.2022',
          title: 'Назначение',
        },
        {
          amount: 'Кол-во токенов',
          summ: '10',
          date: '20.08.2022',
          title: 'Назначение',
        },
        {
          amount: 'Кол-во токенов',
          summ: '10',
          date: '20.08.2022',
          title: 'Назначение',
        },
        {
          amount: 'Кол-во токенов',
          summ: '10',
          date: '20.08.2022',
          title: 'Назначение',
        },
        {
          amount: 'Кол-во токенов',
          summ: '10',
          date: '20.08.2022',
          title: 'Назначение',
        },
        {
          amount: 'Кол-во токенов',
          summ: '10',
          date: '20.08.2022',
          title: 'Назначение',
        },
        {
          amount: 'Кол-во токенов',
          summ: '10',
          date: '20.08.2022',
          title: 'Назначение',
        },
        {
          amount: 'Кол-во токенов',
          summ: '10',
          date: '20.08.2022',
          title: 'Назначение',
        },
        {
          amount: 'Кол-во токенов',
          summ: '10',
          date: '20.08.2022',
          title: 'Назначение',
        },
      ]"
    >
    </ui-table>
  </ui-container>
</template>